In [1]:
import pandas as pd
df = pd.read_pickle("churn_prediction_v3.pkl")
df.head()

,vintage,age,gender,dependents,occupation,city,customer_nw_category,branch_code,current_balance,previous_month_end_balance,average_monthly_balance_prevQ,average_monthly_balance_prevQ2,current_month_credit,previous_month_credit,current_month_debit,previous_month_debit,current_month_balance,previous_month_balance,churn
0,2401,66,Male,0,self_employed,187,2,755,1458.71,1458.71,1458.71,1449.07,0.20,0.20,0.20,0.20,1458.71,1458.71,0.0
1,2648,35,Male,0,self_employed,100000,2,3214,5390.37,8704.66,7799.26,12419.41,0.56,0.56,5486.27,100.56,6496.78,8787.61,0.0
2,2494,31,Male,0,salaried,146,2,41,3913.16,5815.29,4910.17,2815.94,0.61,0.61,6046.73,259.23,5006.28,5070.14,0.0
3,2629,90,Male,1,self_employed,1020,2,582,2291.91,2291.91,2084.54,1006.54,0.47,0.47,0.47,2143.33,2291.91,1669.79,1.0
4,1879,42,Male,2,self_employed,1494,3,388,927.72,1401.72,1643.31,1871.12,0.33,714.61,588.62,1538.06,1157.15,1677.16,1.0

In [2]:
df.columns

Index(['vintage', 'age', 'gender', 'dependents', 'occupation', 'city',
       'customer_nw_category', 'branch_code', 'current_balance',
       'previous_month_end_balance', 'average_monthly_balance_prevQ',
       'average_monthly_balance_prevQ2', 'current_month_credit',
       'previous_month_credit', 'current_month_debit', 'previous_month_debit',
       'current_month_balance', 'previous_month_balance', 'churn'],
      dtype='object')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15929 entries, 0 to 15928
Data columns (total 19 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   vintage                         15929 non-null  int64
 1   age                             15929 non-null  int64
 2   gender                          15929 non-null  category
 3   dependents                      15929 non-null  int64
 4   occupation                      15929 non-null  category
 5   city                            15929 non-null  category
 6   customer_nw_category            15929 non-null  category
 7   branch_code                     15929 non-null  category
 8   current_balance                 15929 non-null  float64
 9   previous_month_end_balance      15929 non-null  float64
 10  average_monthly_balance_prevQ   15929 non-null  float64
 11  average_monthly_balance_prevQ2  15929 non-null  float64
 12  current_month_credit            15929 non-null  float64
 13  previous_month_credit           15929 non-null  float64
 14  current_month_debit             15929 non-null  float64
 15  previous_month_debit            15929 non-null  float64
 16  current_month_balance           15929 non-null  float64
 17  previous_month_balance          15929 non-null  float64
 18  churn                           15929 non-null  category
dtypes: category(6), float64(10), int64(3)
memory usage: 1.7 MB

## Role of Standardization

#### Scores from Stats Class

In [4]:
import numpy as np
scores = np.array([5,15,18,20,22,23,25,29,31,33,36,39])
scores

array([ 5, 15, 18, 20, 22, 23, 25, 29, 31, 33, 36, 39])

In [5]:
scores.mean(), scores.std()

(24.666666666666668, 9.213516640723503)

In [6]:
passing_score = scores.mean() - scores.std()
passing_score

15.453150025943165

In [7]:
# All students who have a score less than 1 std_dev from the mean, will fail !!

In [8]:
# Standardise the scores
scores_std = (scores-scores.mean() ) / scores.std()
scores_std

array([-2.13454509, -1.04918318, -0.72357461, -0.50650222, -0.28942984,
       -0.18089365,  0.03617873,  0.47032349,  0.68739588,  0.90446826,
        1.23007683,  1.5556854 ])

In [9]:
# All students who have a standarized score less than -1 will fail!!!

1. You have exam scores of five students in three different subjects: Math, English, and Science. The scores are measured on different scales, making it challenging to compare and evaluate the performance across subjects. By standardizing the scores, you aim to transform them into a common scale and analyze the relative standing of each student within their respective subject.

In [10]:
import pandas as pd

# Create the dataset
data = {
    'Math': [75, 90, 80, 85, 70],
    'English': [85, 70, 75, 80, 90],
    'Science': [80, 65, 90, 75, 85]
}

exams_df = pd.DataFrame(data)
exams_df['Math'] = exams_df['Math']*2

In [11]:
exams_df['Total Score'] = exams_df.sum(axis=1)
exams_df

   Math  English  Science  Total Score
0   150       85       80          315
1   180       70       65          315
2   160       75       90          325
3   170       80       75          325
4   140       90       85          315

In [12]:
# Calculate the mean and standard deviation for each subject
means = exams_df.mean()
std_devs = exams_df.std()

means, std_devs

(Math           160.0
 English         80.0
 Science         79.0
 Total Score    319.0
 dtype: float64,
 Math           15.811388
 English         7.905694
 Science         9.617692
 Total Score     5.477226
 dtype: float64)

In [13]:
# Standardize the scores
standardized_df = (exams_df - means) / std_devs
standardized_df

       Math   English   Science  Total Score
0 -0.632456  0.632456  0.103975    -0.730297
1  1.264911 -1.264911 -1.455651    -0.730297
2  0.000000 -0.632456  1.143726     1.095445
3  0.632456  0.000000 -0.415900     1.095445
4 -1.264911  1.264911  0.623850    -0.730297

In [14]:
# Calculate the total standardized score for each student
standardized_df['Total Score'] = standardized_df.sum(axis=1)
standardized_df

       Math   English   Science  Total Score
0 -0.632456  0.632456  0.103975    -0.626322
1  1.264911 -1.264911 -1.455651    -2.185947
2  0.000000 -0.632456  1.143726     1.606715
3  0.632456  0.000000 -0.415900     1.312000
4 -1.264911  1.264911  0.623850    -0.106446

In [15]:
# Find the best scoring student
best_student = standardized_df['Total Score'].idxmax()

print(f"The best scoring student overall is Student {best_student}")

The best scoring student overall is Student 2

## 2. Stock Market Returns:
When analyzing stock market data, comparing the returns of different stocks or indices can be challenging if they have different magnitudes or volatilities. Standardizing the returns by calculating the z-score (number of standard deviations from the mean) allows for a more rational comparison. It enables you to evaluate how each stock or index performs relative to its own historical performance, considering the risk and volatility associated with each investment. This standardized analysis helps remove the influence of scale and facilitates a more meaningful comparison.

In [16]:
import pandas as pd
# np.random.seed(105)
# Create the dataset
# data = np.round(0.1*np.random.randn(5,5), 3)
# stock_df = pd.DataFrame(data, columns=['Stock 1', 'Stock 2', 'Stock 3', 'Stock 4', 'Stock 5'])

data = {
    'Stock 1': [0.02, -0.01, 0.03, -0.02, 0.01],
    'Stock 2': [0.04, 0.02, -0.01, 0.01, 0.02],
    'Stock 3': [0.01, 0.03, -0.02, 0.02, -0.03],
    'Stock 4': [-0.03, 0.01, 0.04, -0.01, 0.02],
    'Stock 5': [0.05, -0.02, 0.01, 0.03, 0.01]
}

stock_df = pd.DataFrame(data)
stock_df

   Stock 1  Stock 2  Stock 3  Stock 4  Stock 5
0     0.02     0.04     0.01    -0.03     0.05
1    -0.01     0.02     0.03     0.01    -0.02
2     0.03    -0.01    -0.02     0.04     0.01
3    -0.02     0.01     0.02    -0.01     0.03
4     0.01     0.02    -0.03     0.02     0.01

In [17]:
stock_df.sum()

Stock 1    0.03
Stock 2    0.08
Stock 3    0.01
Stock 4    0.03
Stock 5    0.08
dtype: float64

In [18]:
# Calculate the mean and standard deviation for each stock's returns
means = stock_df.mean()
std_devs = stock_df.std()

# Standardize the returns
standardized_df = (stock_df - means) / std_devs

standardized_df  # standardized returns for alll the stocks for these 5 days

    Stock 1   Stock 2   Stock 3   Stock 4   Stock 5
0  0.675140  1.321157  0.309067 -1.332420  1.303840
1 -0.771589  0.220193  1.081734  0.148047 -1.380537
2  1.157383 -1.431253 -0.849934  1.258396 -0.230089
3 -1.253831 -0.330289  0.695401 -0.592187  0.536875
4  0.192897  0.220193 -1.236268  0.518163 -0.230089

In the standardized dataset, the returns of each stock are transformed into a common scale, allowing for a more rational comparison. The z-scores reflect how each stock's returns deviate from its own mean, taking into account the risk and volatility associated with each investment. This standardized analysis helps remove the influence of scale and facilitates a more meaningful comparison of stock performance.

In [19]:
standardized_df.mean()  # average standardized return for the 5-day period

Stock 1   -1.110223e-17
Stock 2   -2.775558e-17
Stock 3   -4.440892e-17
Stock 4    2.220446e-17
Stock 5   -2.775558e-17
dtype: float64

In [20]:
standardized_df.sum()  # Sum pf the standardized returns for the 5-day period

Stock 1   -5.551115e-17
Stock 2   -1.387779e-16
Stock 3   -2.220446e-16
Stock 4    1.110223e-16
Stock 5   -1.387779e-16
dtype: float64

In [21]:
# Concl. the Stock 4 performance has been the best in these 5 days!!!